<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Village;

class VillageSeeder extends Seeder
{
    public function run()
    {
        $villages = [
          'آباده',
'ابراهیم‌آباد',
'اسماعیل‌آباد',
'اشجرد',
'اونجان',
'بارزآباد',
'بنی یکه',
'بورکی',
'بیدگل',
'تل سرخ',
'تیره‌باغ',
'جمال‌آباد',
'جونکی',
'جهان‌آباد',
'چاه میلک',
'چمنی',
'حسین‌آباد قرق',
'دره باد',
'دهستان ابرج',
'دهستان درودزن',
'دهستان رامجرد دو',
'رامجرد',
'زراره',
'زرمنجان',
'سعادت‌آباد',
'سهل‌آباد',
'فتوح‌آباد',
'قرخلو',
'قلعه نو',
'کندازی',
'گل‌مکان باصری',
'گل‌مکان قشلاق',
'گله زن',
'مائین',
'ماده بانان',
'مالیچه',
'معصوم‌آباد',
'ملک‌آباد',
'میانرود',
'نصرآباد',
'نگارستان',
'نوسنجان',
'هاشم‌آباد'

        ];

        foreach ($villages as $village) {
            Village::create(['name' => $village]);
        }
    }
}